ИнКар.Маркетплейсы/src/Catalogs/МП_Профили/МП_Профили.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МП_Профили</name>
  <attributes>
    <name>ВидМаркетплейса</name>
    <type>
      <types>EnumRef.МП_ВидыМаркетплейсов</types>
    </type>
  </attributes>
  <attributes>
    <name>Client_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Client_secret</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделительРазделов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Шапка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подвал</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликоватьКартинки</name>
    <type>
      <types>EnumRef.МП_ВариантыПубликацииКартинок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликоватьМоделиАвтомобилей</name>
    <type>
      <types>EnumRef.МП_ВариантыПубликацииМоделейАвтомобилей</types>
    </type>
  </attributes>
  <attributes>
    <name>МоделиШапка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МоделиПодвал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВедущийМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантФормированияНаличия</name>
    <type>
      <types>EnumRef.МП_ВариантыФормированияНаличия</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОсновной</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеШапка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеПодвал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеОНедоступности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПредставленияСкладов</name>
    <type>
      <types>EnumRef.МП_ВариантыПредставленияСкладов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликоватьПроизводителя</name>
    <type>
      <types>EnumRef.МП_ВариантыИспользованияПроизводителя</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликоватьОписаниеВида</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликоватьОписаниеНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозможностьНаписатьСообщениеПоОбъявлениюЧерезСайт</name>
    <comment>&lt;AllowEmail>Нет&lt;/AllowEmail></comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>URLЗагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитВидео</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗоныПоказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Shop_name</name>
    <comment>Короткое название магазина. В названии нельзя использовать слова, которые не относятся к наименованию магазина (например «лучший», «дешевый»), указывать номер телефона и т. п.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Shop_company</name>
    <comment>Полное наименование компании, владеющей магазином. Не публикуется.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Shop_url</name>
    <comment>URL главной страницы магазина. Максимальная длина ссылки — 2048 символов. Допускаются кириллические ссылки. URL‑адрес формируется на основе стандарта RFC 3986</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Shop_email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияОбъявления</name>
    <comment>&lt;Category>Запчасти и аксессуары&lt;/Category></comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗоныПоказа</name>
    <attributes>
      <name>ЗонаПоказа</name>
      <type>
        <types>CatalogRef.МП_АвитоЗоныПоказа</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СегментыНоменклатуры</name>
    <attributes>
      <name>Сегмент</name>
      <type>
        <types>CatalogRef.СегментыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоОсновнойСегмент</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПлатногоРазмещения</name>
      <comment>&lt;ListingFee>PackageSingle&lt;/ListingFee></comment>
      <type>
        <types>EnumRef.МП_АвитоВариантыПлатногоРазмещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлатнаяУслуга</name>
      <comment>&lt;AdStatus>x10_7&lt;/AdStatus></comment>
      <type>
        <types>CatalogRef.МП_АвитоПлатныеУслуги</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОбъявления</name>
      <comment>&lt;AdType>Товар от производителя&lt;/AdType></comment>
      <type>
        <types>EnumRef.МП_АвитоВидыОбъявлений</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <comment>&lt;Condition>Новое&lt;/Condition></comment>
      <type>
        <types>EnumRef.МП_АвитоСостояние</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИнКар.Маркетплейсы/src/Enums/МП_ВидыМаркетплейсов/МП_ВидыМаркетплейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МП_ВидыМаркетплейсов</name>
  <enumValues>
    <name>VK</name>
  </enumValues>
  <enumValues>
    <name>ДРОМ</name>
  </enumValues>
  <enumValues>
    <name>Avito</name>
  </enumValues>
  <enumValues>
    <name>СберМегаМаркет</name>
  </enumValues>
  <enumValues>
    <name>Юла</name>
  </enumValues>
  <enumValues>
    <name>ДубльГис</name>
  </enumValues>
</mdclass:Enum>

ИнКар.Маркетплейсы/src/Catalogs/МП_Профили/Forms/ФормаЭлемента/Module.bsl
//
//	Филимонов И.В.
//		+7 913 240 81 77
//		
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Возврат;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийШапкиФормы

&НаКлиенте
Процедура ВидМаркетплейсаПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьТекстовыйЭлемент(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Реквизит = Элемент.Имя;

	ПараметрыОповещения = Новый Структура("Реквизит", Реквизит);

	Оповещение = Новый ОписаниеОповещения("ПослеВводаСтроки", ЭтотОбъект, ПараметрыОповещения);
	ПоказатьВводСтроки(Оповещение, Объект[Реквизит], "Изменение шапки объявления",, Истина);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()

	ЯндексМагазин = (Объект.ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.МП_ВидыМаркетплейсов.VK")
					 Или Объект.ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.МП_ВидыМаркетплейсов.ДРОМ")
					 Или Объект.ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.МП_ВидыМаркетплейсов.СберМегаМаркет")
					 Или Объект.ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.МП_ВидыМаркетплейсов.Юла")
					 Или Объект.ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.МП_ВидыМаркетплейсов.ДубльГис"));

	Элементы.ГруппаАккаунт.Видимость = Не ЯндексМагазин;
	Элементы.ГруппаЗоныПоказа.Видимость = Не ЯндексМагазин;
	Элементы.ГруппаСегментыАвито.Видимость = Не ЯндексМагазин;
//	Элементы.ГруппаКонтакты.Видимость = Не ЯндексМагазин;

	Элементы.ГруппаОписаниеМагазина.Видимость = ЯндексМагазин;

КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСтроки(Строка, Параметры) Экспорт

	Если Строка <> Неопределено Тогда
		Модифицированность = Истина;
		Объект[Параметры.Реквизит] = Строка;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
